org/basic/myinit.org
#+TITLE: Org Mode - Organize Your Life In Plain Text!
#+STARTUP: overview
#+AUTHOR: xing wenjuIRC: linuxing3 on freenode
#+EMAIL: xingwenju@gmail.com

This file should be called from =init.el= file of emacs with =babel-load=

* Interface tweaks

Setting the easy and quick operator

#+BEGIN_SRC emacs-lisp
  (setq inhibit-startup-message t)
  (tool-bar-mode -1)
  (fset 'yes-or-no-p 'y-or-n-p)

  ;; Setting English Font
  (set-face-attribute
   'default nil :font "Source Code Pro 14")
  ;; Chinese Font ÅäÖÆÖÐÎÄ×ÖÌå
  ;;(dolist (charset '(kana han symbol cjk-misc bopomofo))
  ;;  (set-fontset-font (frame-parameter nil 'font)
  ;;                    charset
  ;;                    (font-spec :family "Microsoft Yahei" :size 16)))

#+END_SRC

#+RESULTS:

* Try

Package =try= can guess your next operation

#+BEGIN_SRC emacs-lisp
(use-package try
    :ensure t)
#+END_SRC

#+RESULTS:

* Which key

Brings up some help

  #+BEGIN_SRC emacs-lisp
  (use-package which-key
    :ensure t
    :config
    (which-key-mode))
  #+END_SRC
* Evil mode

/vim/ Emulator can implement =vim= mode

#+BEGIN_SRC emacs-lisp
(use-package evil
 :config
 (evil-mode 1)
)
#+END_SRC

#+RESULTS:
: t

* Ace windows

For easy window switching
  #+BEGIN_SRC emacs-lisp
  (use-package ace-window
  :ensure t
  :init
  (progn
  (setq aw-scope 'frame)
  (global-set-key (kbd "C-x O") 'other-frame)
    (global-set-key [remap other-window] 'ace-window)
    (custom-set-faces
     '(aw-leading-char-face
       ((t (:inherit ace-jump-face-foreground :height 3.0)))))
    ))
  #+END_SRC

  #+RESULTS:

* Swiper / Ivy / Counsel
  Swiper gives us a really efficient incremental search with regular expressions
  and Ivy / Counsel replace a lot of ido or helms completion functionality
  #+BEGIN_SRC emacs-lisp


     (use-package counsel
      :ensure t
      :bind
      (("M-y" . counsel-yank-pop)
      :map ivy-minibuffer-map
      ("M-y" . ivy-next-line)))


    (use-package ivy
    :ensure t
    :diminish (ivy-mode)
    :bind (("C-x b" . ivy-switch-buffer))
    :config
    (ivy-mode 1)
    (setq ivy-use-virtual-buffers t)
    (setq ivy-switch-buffer-faces-alist
      '((emacs-lisp-mode . swiper-match-face-1)
    (dired-mode . ivy-subdir)
    (org-mode . org-level-4)))
    (setq ivy-count-format "%d/%d ")
    (setq ivy-display-style 'fancy))


    (use-package swiper
    :ensure t
    :bind (("C-r" . swiper)
       ("C-c C-r" . ivy-resume)
       ("M-x" . counsel-M-x)
       ("C-x C-f" . counsel-find-file))
    :config
    (progn
      (ivy-mode 1)
      (setq ivy-use-virtual-buffers t)
      (setq ivy-display-style 'fancy)
      (define-key read-expression-map (kbd "C-r") 'counsel-expression-history)
      ))


    (use-package ivy-hydra
    :ensure t
    :config
    (progn (message "ivy-hydra is enabled!"))
    )
  #+END_SRC

  #+RESULTS:
  : t

* Avy
Navigate by searching for a letter on the screen and jumping to it
See https://github.com/abo-abo/avy for more info
  #+BEGIN_SRC emacs-lisp
  (use-package avy
  :ensure t
  :bind ("M-s" . avy-goto-word-1)) ;; changed from char as per jcs
  #+END_SRC

* Autocomplete
  #+BEGIN_SRC emacs-lisp
  (use-package auto-complete
  :ensure t
  :init
  (progn
    (ac-config-default)
    (global-auto-complete-mode t)
    ))
  #+END_SRC

* Themes and modeline
  #+BEGIN_SRC emacs-lisp

    (use-package color-theme
    :ensure t)

    (use-package zenburn-theme
      :ensure t)

    (use-package github-modern-theme
    :ensure t)

    (use-package base16-theme
    :ensure t
    )

    (use-package moe-theme
    :ensure t)

    (use-package alect-themes
    :ensure t)


    (use-package powerline
    :ensure t
    :config
    (powerline-moe-theme)
    )

    ;; (load-theme 'base16-flat t)
    (moe-dark)
  #+END_SRC

  #+RESULTS:
  : t

* Reveal.js
  #+BEGIN_SRC emacs-lisp :tangle no
    (use-package ox-reveal
      :ensure t
      :init
      (load-library "ox-reveal")
      :config
      (load-library "ox-reveal")
      (setq org-reveal-root "")
      (setq org-reveal-mathjax t)
     )

    (defun org-reveal-root-toggle ()
      "Checking revealjs root, if online use cdn url
      if offline use current directory"
    (interactive)
    ;; Using the default location, you must download manually the revealjs files
    (setq org-reveal-root "http://cdn.jsdelivr.net/reveal.js/3.0.0/")
    (message org-reveal-root)
    )

    (use-package htmlize
      :ensure t)
  #+END_SRC

  #+RESULTS:

* ox-hugo

ox-hugo implements a Markdown back-end for Org exporter.  The
exported Markdown is compatible with the Hugo static site generator
(https://gohugo.io/).

This exporter also generates the post front-matter in TOML or YAML.

To start using this exporter, add the below to your Emacs config:

Info: [[https://melpa.org/?utm_source=dlvr.it&utm_medium=twitter#/ox-hugo][ox-hugo on melpa]]

#+BEGIN_SRC emacs-lisp
;;(with-eval-after-load 'ox
;;   (require 'ox-hugo))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  ;; Main blog
  (use-package helm-ag :ensure t)
  (use-package easy-hugo :ensure t)
  (setq easy-hugo-basedir "~/Dropbox/xingwenju.com/")
  (setq easy-hugo-url "https://yourblogdomain")
  (setq easy-hugo-sshdomain "blogdomain")
  (setq easy-hugo-root "~/Dropbox/org/blogs")
  (setq easy-hugo-previewtime "300")
  ;; Total number of blogs
  (setq easy-hugo-blog-number 3)
  ;; Blog1
  (setq easy-hugo-basedir-1 "~/Dropbox/xingwenju.com/blog1/")
  (setq easy-hugo-url-1 "http://example1.com")
  (setq easy-hugo-root-1 "~/Dropbox/org/blogs")
  (setq easy-hugo-sshdomain-1 "blog1domain")
#+END_SRC

#+RESULTS:
: blog1domain

* calfw as calender

A beautiful calendar view for org agenda

#+BEGIN_SRC emacs-lisp
(use-package calfw :ensure t)
(use-package calfw-org :ensure t)
#+END_SRC

#+RESULTS:

* Flycheck

Speelling checking

  #+BEGIN_SRC emacs-lisp
    (use-package flycheck
      :ensure t
      :init
      (global-flycheck-mode t)
      :config
      ;; (when (require 'flycheck nil t)
      ;;	(setq elpy-modules (delq 'elpy-module-flymake elpy-modules))
      ;;	(add-hook 'elpy-mode-hook 'flycheck-mode))
      )


  #+END_SRC

  #+RESULTS:
  : t

* Python

 As python is quick and effective, to save time, you should give it a
 try.

 All the packages is powerful.

 You can make a IDE with =elpy= package.

 However, you need to do some tweaks to improve the performance.

** Using Jedi as check tool

   You may need to run =jedi:setup-server= to install and activate
   server.

   After that, everything is just a quick go.

#+BEGIN_SRC emacs-lisp

  (setq py-python-command "python3")
  (setq python-shell-interpreter "python3")

  ;; (use-package jedi
  ;;   :ensure t
  ;;   :init
  ;;   (add-hook 'python-mode-hook 'jedi:setup)
  ;;   (add-hook 'python-mode-hook 'jedi:ac-setup))

#+END_SRC

** IDE of python with =elpy=

  It turns out that Elpy, a popular emacs package for python
  Setting up yasnippet is as easy as:

  Don't forget to install the =virtualenv= and =pylint= packages

#+BEGIN_SRC emacs-lisp
  ;; (add-to-list 'package-archives '("elpy" . "https://jorgenschaefer.github.io/packages/"))
  (use-package elpy
    :ensure t
    :config
    (elpy-use-ipython)
    ;; (setenv WORKON_HOME "~/")
    (if (string-equal system-type "darwin")
       (pyvenv-activate "~/anaconda")
    )
    (if (string-equal system-type "darwin")
       (pyvenv-activate "~/myenv")
    )
    (defalias 'workon 'pyvenv-workon)
    (elpy-enable))

#+END_SRC

#+RESULTS:
: t

** virtualenvwrapper

#+BEGIN_SRC emacs-lisp
    (use-package virtualenvwrapper
      :ensure t
      :config
      (venv-initialize-interactive-shells)
      (venv-initialize-eshell))

  #+END_SRC

  #+RESULTS:
  : t


If you’d like to go one step further and have Elpy switch to a local
version of pyenv when you enter a project folder, put this function in
your .emacs:

#+BEGIN_SRC emacs-lisp
(defun ssbb-pyenv-hook ()
"Automatically activates pyenv version if .python-version file
exists."
(f-traverse-upwards
(lambda (path)
  (let ((pyenv-version-path (f-expand ".python-version" path)))
  (if (f-exists? pyenv-version-path)
  (pyenv-mode-set (s-trim (f-read-text pyenv-version-path 'utf-8))))))))

(add-hook 'find-file-hook 'ssbb-pyenv-hook)

#+END_SRC

#+RESULTS:
| ssbb-pyenv-hook | recentf-track-opened-file | url-handlers-set-buffer-mode | global-git-gutter-mode-check-buffers | magit-edit-branch*description-check-buffers | magit-auto-revert-mode-check-buffers | git-commit-setup-check-buffer | projectile-find-file-hook-function | #[nil \302\301!\210\303\304!8\211\207 [buffer-file-name auto-revert-tail-pos make-local-variable 7 file-attributes] 3] | global-hungry-delete-mode-check-buffers | yas-global-mode-check-buffers | global-flycheck-mode-check-buffers | global-auto-complete-mode-check-buffers | evil-mode-check-buffers | global-undo-tree-mode-check-buffers | undo-tree-load-history-hook | global-font-lock-mode-check-buffers | epa-file-find-file-hook | vc-find-file-hook | tramp-set-auto-save | save-place-find-file-hook |

Finally, to clean up whitespace on a save, add:

#+BEGIN_SRC emacs-lisp
(add-hook 'before-save-hook 'whitespace-cleanup)
#+END_SRC

* Undo Tree
  #+BEGIN_SRC emacs-lisp
    (use-package undo-tree
      :ensure t
      :init
      (global-undo-tree-mode))
  #+END_SRC

* Yasnippet

    I use it for boilerplate code. The example in the video shows how I
    set up a snippet for the boilerplate code used when creating an
    application with the Flask python microframework.

    In order to use this, you need to add some =snippets= to your
    directory.

    Then typeset the =keyword= and type =TAB= to expand the snippets.

    When you edit a new snippets, it will be added to the mode.

  #+BEGIN_SRC emacs-lisp
    (use-package yasnippet
      :ensure t
      :init
    (yas-global-mode 1))

  #+END_SRC

[[https://github.com/AndreaCrotti/yasnippet-snippets][snippets for yasnippet]]

  #+BEGIN_SRC emacs-lisp
     ;; (add-to-list 'package-archives
     ;;          '("melpa" . "http://melpa.milkbox.net/packages/") t)
     ;; (package-refresh-contents)
     ;; (package-install "yasnippet-snippets")
  #+END_SRC

* Misc packages
  #+BEGIN_SRC emacs-lisp

  ; Highlights the current cursor line
  (global-hl-line-mode t)

  ; flashes the cursor's line when you scroll
  (use-package beacon
  :ensure t
  :config
  (beacon-mode 1)
  (setq beacon-color "#666600")
  )

  ; deletes all the whitespace when you hit backspace or delete
  (use-package hungry-delete
  :ensure t
  :config
  (global-hungry-delete-mode))

  ; expand the marked region in semantic increments (negative prefix to reduce region)
  (use-package expand-region
  :ensure t
  :config
  (global-set-key (kbd "C-=") 'er/expand-region))

  (setq save-interprogram-paste-before-kill t)

  (global-auto-revert-mode 1) ;; you might not want this
  (setq auto-revert-verbose nil) ;; or this

  #+END_SRC

  #+RESULTS:
  : revert-buffer

* iedit and narrow / widen dwim

  #+BEGIN_SRC emacs-lisp
  ; mark and edit all copies of the marked region simultaniously.
  (use-package iedit
  :ensure t)

  ; if you're windened, narrow to the region, if you're narrowed, widen
  ; bound to C-x n
  (defun narrow-or-widen-dwim (p)
  "If the buffer is narrowed, it widens. Otherwise, it narrows intelligently.
  Intelligently means: region, org-src-block, org-subtree, or defun,
  whichever applies first.
  Narrowing to org-src-block actually calls `org-edit-src-code'.

  With prefix P, don't widen, just narrow even if buffer is already
  narrowed."
  (interactive "P")
  (declare (interactive-only))
  (cond ((and (buffer-narrowed-p) (not p)) (widen))
  ((region-active-p)
  (narrow-to-region (region-beginning) (region-end)))
  ((derived-mode-p 'org-mode)
  ;; `org-edit-src-code' is not a real narrowing command.
  ;; Remove this first conditional if you don't want it.
  (cond ((ignore-errors (org-edit-src-code))
  (delete-other-windows))
  ((org-at-block-p)
  (org-narrow-to-block))
  (t (org-narrow-to-subtree))))
  (t (narrow-to-defun))))

  ;; (define-key endless/toggle-map "n" #'narrow-or-widen-dwim)
  ;; This line actually replaces Emacs' entire narrowing keymap, that's
  ;; how much I like this command. Only copy it if that's what you want.
  (define-key ctl-x-map "n" #'narrow-or-widen-dwim)

  #+END_SRC


  #+RESULTS:
  : narrow-or-widen-dwim

* Web Mode
#+BEGIN_SRC emacs-lisp
    (use-package web-mode
      :ensure t
      :config
       (add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))
       (add-to-list 'auto-mode-alist '("\\.vue?\\'" . web-mode))
       (setq web-mode-engines-alist
         '(("django"    . "\\.html\\'")))
       (setq web-mode-ac-sources-alist
       '(("css" . (ac-source-css-property))
       ("vue" . (ac-source-words-in-buffer ac-source-abbrev))
       ("html" . (ac-source-words-in-buffer ac-source-abbrev))))
  (setq web-mode-enable-auto-closing t))
  (setq web-mode-enable-auto-quoting t) ; this fixes the quote problem I mentioned


#+END_SRC

#+RESULTS:
: t
* Emmet mode
#+BEGIN_SRC emacs-lisp
(use-package emmet-mode
:ensure t
:config
(add-hook 'sgml-mode-hook 'emmet-mode) ;; Auto-start on any markup modes
(add-hook 'web-mode-hook 'emmet-mode) ;; Auto-start on any markup modes
(add-hook 'css-mode-hook  'emmet-mode) ;; enable Emmet's css abbreviation.
)
#+END_SRC
