org/basic/myinit.org
* Javascript
#+BEGIN_SRC emacs-lisp
(use-package js2-mode
:ensure t
:ensure ac-js2
:init
(progn
(add-hook 'js-mode-hook 'js2-minor-mode)
(add-hook 'js2-mode-hook 'ac-js2-mode)
))

(use-package js2-refactor
:ensure t
:config
(progn
(js2r-add-keybindings-with-prefix "C-c C-m")
;; eg. extract function with `C-c C-m ef`.
(add-hook 'js2-mode-hook #'js2-refactor-mode)))
(use-package tern
:ensure tern
:ensure tern-auto-complete
:config
(progn
(add-hook 'js-mode-hook (lambda () (tern-mode t)))
(add-hook 'js2-mode-hook (lambda () (tern-mode t)))
(add-to-list 'auto-mode-alist '("\\.js\\'" . js2-mode))
(tern-ac-setup)
))

;;(use-package jade
;;:ensure t
;;)

(use-package nodejs-repl
:ensure t
)

(add-hook 'js-mode-hook
      (lambda ()
        (define-key js-mode-map (kbd "C-x C-e") 'nodejs-repl-send-last-sexp)
        (define-key js-mode-map (kbd "C-c C-r") 'nodejs-repl-send-region)
        (define-key js-mode-map (kbd "C-c C-l") 'nodejs-repl-load-file)
        (define-key js-mode-map (kbd "C-c C-z") 'nodejs-repl-switch-to-repl)))
#+END_SRC

#+RESULTS:

* DIRED
#+BEGIN_SRC emacs-lisp
(use-package dired+
  :ensure t
  :config (require 'dired+)
  )


(use-package dired-quick-sort
  :ensure t
  :config
  (dired-quick-sort-setup))

#+END_SRC
* Important productivity
#+BEGIN_SRC emacs-lisp

(setq user-full-name "Xing Wenju"
      user-mail-address "xingwenju@gmail.com")
;;--------------------------------------------------------------------------

;;--------------------------------------------------------------------------
;; latex
(use-package tex
:ensure auctex)

(defun tex-view ()
    (interactive)
    (tex-send-command "evince" (tex-append tex-print-file ".pdf")))


;;--------------------------------------------------------------------------

;; babel stuff

(org-babel-do-load-languages
 'org-babel-load-languages
 '((python . t)
   (emacs-lisp . t)
   (C . t)
   (js . t)
   (ditaa . t)
   (dot . t)
   (org . t)
   (shell . t )
   (latex . t )
   ))


;;--------------------------------------------------------------------------

;; projectile
(use-package projectile
  :ensure t
  :config
  (projectile-global-mode)
(setq projectile-completion-system 'ivy))

(use-package counsel-projectile
  :ensure t
  :config
  (counsel-projectile-on))

;;--------------------------------------------------------------------------
;; (use-package smartparens
;; :ensure t
;; :config
;; (use-package smartparens-config)
;; (use-package smartparens-html)
;; (use-package smartparens-python)
;; (use-package smartparens-latex)
;; (smartparens-global-mode t)
;; (show-smartparens-global-mode t))

;;--------------------------------------------


(use-package cider
  :ensure t
  :config
  ; this is to make cider-jack-in-cljs work
  (setq cider-cljs-lein-repl
      "(do (require 'figwheel-sidecar.repl-api)
       (figwheel-sidecar.repl-api/start-figwheel!)
       (figwheel-sidecar.repl-api/cljs-repl))")

  )

(use-package ac-cider
  :ensure t
  :config
  (add-hook 'cider-mode-hook 'ac-flyspell-workaround)
  (add-hook 'cider-mode-hook 'ac-cider-setup)
  (add-hook 'cider-repl-mode-hook 'ac-cider-setup)
  (eval-after-load "auto-complete"
    '(progn
       (add-to-list 'ac-modes 'cider-mode)
       (add-to-list 'ac-modes 'cider-repl-mode)))
  )

;;--------------------------------------------------------------------------
(use-package magit
:ensure t
:init
(progn
(bind-key "C-x g" 'magit-status)
))

(use-package git-gutter
:ensure t
:init
(global-git-gutter-mode +1))

(use-package git-timemachine
:ensure t
)

;; font scaling
(use-package default-text-scale
  :ensure t
  :config
  (global-set-key (kbd "C-M-=") 'default-text-scale-increase)
  (global-set-key (kbd "C-M--") 'default-text-scale-decrease))

#+END_SRC

* Flyspell and autofill

  In order to use the =ispell= you can install more dictionaries like
  *spanish*

  =ispanish= is the package name.

  Then turn on =flycheck= on =org-mode= by using =hook=

#+BEGIN_SRC emacs-lisp
(add-hook 'org-mode-hook 'turn-on-flyspell)
(add-hook 'org-mode-hook 'turn-on-auto-fill)
(add-hook 'mu4e-compose-mode-hook 'turn-on-flyspell)
(add-hook 'mu4e-compose-mode-hook 'turn-on-auto-fill)
#+END_SRC

* Youdao dictionary
    有道词典
    #+BEGIN_SRC emacs-lisp
    (use-package youdao-dictionary
    :ensure t)
    #+END_SRC
* Better Shell
#+BEGIN_SRC emacs-lisp :tangle no
(use-package better-shell
    :ensure t
    :bind (("C-'" . better-shell-shell)
       ("C-;" . better-shell-remote-open)))
#+END_SRC
* eshell stuff
#+BEGIN_SRC emacs-lisp

  (use-package shell-switcher
    :ensure t
    :config
    (setq shell-switcher-mode t)
    :bind (("C-'" . shell-switcher-switch-buffer)
       ("C-x 4 '" . shell-switcher-switch-buffer-other-window)
       ("C-M-'" . shell-switcher-new-shell)))


  ;; Visual commands
  (setq eshell-visual-commands '("vi" "screen" "top" "less" "more" "lynx"
                 "ncftp" "pine" "tin" "trn" "elm" "vim"
                 "nmtui" "alsamixer" "htop" "el" "elinks"
                 ))
  (setq eshell-visual-subcommands '(("git" "log" "diff" "show")))
  (setq eshell-list-files-after-cd t)
  (defun eshell-clear-buffer ()
    "Clear terminal"
    (interactive)
    (let ((inhibit-read-only t))
      (erase-buffer)
      (eshell-send-input)))
  (add-hook 'eshell-mode-hook
        '(lambda()
           (local-set-key (kbd "C-l") 'eshell-clear-buffer)))

  (defun eshell/magit ()
    "Function to open magit-status for the current directory"
    (interactive)
    (magit-status default-directory)
    nil)

 ;; smart display stuff
(require 'eshell)
(require 'em-smart)
(setq eshell-where-to-jump 'begin)
(setq eshell-review-quick-commands nil)
(setq eshell-smart-space-goes-to-end t)

(add-hook 'eshell-mode-hook
  (lambda ()
    (eshell-smart-initialize)))
;; eshell here
(defun eshell-here ()
  "Opens up a new shell in the directory associated with the
current buffer's file. The eshell is renamed to match that
directory to make multiple eshell windows easier."
  (interactive)
  (let* ((parent (if (buffer-file-name)
             (file-name-directory (buffer-file-name))
           default-directory))
     (height (/ (window-total-height) 3))
     (name   (car (last (split-string parent "/" t)))))
    (split-window-vertically (- height))
    (other-window 1)
    (eshell "new")
    (rename-buffer (concat "*eshell: " name "*"))

    (insert (concat "ls"))
    (eshell-send-input)))

(global-set-key (kbd "C-!") 'eshell-here)

#+END_SRC

Eshell prompt
#+BEGIN_SRC emacs-lisp
 (defcustom dotemacs-eshell/prompt-git-info
  t
  "Turns on additional git information in the prompt."
  :group 'dotemacs-eshell
  :type 'boolean)

;; (epe-colorize-with-face "abc" 'font-lock-comment-face)
(defmacro epe-colorize-with-face (str face)
  `(propertize ,str 'face ,face))

(defface epe-venv-face
  '((t (:inherit font-lock-comment-face)))
  "Face of python virtual environment info in prompt."
  :group 'epe)

  (setq eshell-prompt-function
      (lambda ()
    (concat (propertize (abbreviate-file-name (eshell/pwd)) 'face 'eshell-prompt)
        (when (and dotemacs-eshell/prompt-git-info
               (fboundp #'vc-git-branches))
          (let ((branch (car (vc-git-branches))))
            (when branch
              (concat
               (propertize " [" 'face 'font-lock-keyword-face)
               (propertize branch 'face 'font-lock-function-name-face)
               (let* ((status (shell-command-to-string "git status --porcelain"))
                  (parts (split-string status "\n" t " "))
                  (states (mapcar #'string-to-char parts))
                  (added (count-if (lambda (char) (= char ?A)) states))
                  (modified (count-if (lambda (char) (= char ?M)) states))
                  (deleted (count-if (lambda (char) (= char ?D)) states)))
             (when (> (+ added modified deleted) 0)
               (propertize (format " +%d ~%d -%d" added modified deleted) 'face 'font-lock-comment-face)))
               (propertize "]" 'face 'font-lock-keyword-face)))))
        (when (and (boundp #'venv-current-name) venv-current-name)
          (concat
            (epe-colorize-with-face " [" 'epe-venv-face)
            (propertize venv-current-name 'face `(:foreground "#2E8B57" :slant italic))
            (epe-colorize-with-face "]" 'epe-venv-face)))
        (propertize " $ " 'face 'font-lock-constant-face))))
#+END_SRC
#+RESULTS:
: t
