org/basic/myinit.org
* Elfeed
#+BEGIN_SRC emacs-lisp


  (use-package elfeed
    :ensure t
    :config
    (setq elfeed-db-directory "~/Dropbox/shared/elfeeddb")
    (setq elfeed-feeds
    '("http://nullprogram.com/feed/"
      "http://jr0cket.co.uk/atom.xml"
      "https://linuxing3.github.io/rss.xml"
      "http://ergoemacs.org/emacs/blog.xml"
      "http://planet.emacsen.org/atom.xml"))
    )


  ;; wget https://github.com/remyhonig/elfeed-org/blob/master/elfeed-org.el
  (use-package elfeed-org
    :ensure t
    :config
   (setq rmh-elfeed-org-files (list
     "~/Dropbox/config/emacs/literate/xingwenju-elfeed-resource.org"
    )))

#+END_SRC

#+RESULTS:

* c++
#+BEGIN_SRC emacs-lisp
(use-package ggtags
:ensure t
:config
(add-hook 'c-mode-common-hook
      (lambda ()
        (when (derived-mode-p 'c-mode 'c++-mode 'java-mode)
          (ggtags-mode 1))))
)

#+END_SRC

#+RESULTS:

* Dumb jump
#+BEGIN_SRC emacs-lisp

(use-package dumb-jump
  :bind (("M-g o" . dumb-jump-go-other-window)
     ("M-g j" . dumb-jump-go)
     ("M-g x" . dumb-jump-go-prefer-external)
     ("M-g z" . dumb-jump-go-prefer-external-other-window))
  :config
  ;; (setq dumb-jump-selector 'ivy) ;; (setq dumb-jump-selector 'helm)
:init
(dumb-jump-mode)
  :ensure
)



#+END_SRC
* Origami folding
#+BEGIN_SRC emacs-lisp
(use-package origami
:ensure t)
#+END_SRC

#+RESULTS:

* IBUFFER

To Group the buffers, use filtered groups

#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-x C-b") 'ibuffer)
  (setq ibuffer-saved-filter-groups
    (quote (("default"
         ("dired" (mode . dired-mode))
         ("org" (name . "^.*org$"))

         ("web" (or (mode . web-mode) (mode . js2-mode)))
         ("shell" (or (mode . eshell-mode) (mode . shell-mode)))
         ("mu4e" (or

         (mode . mu4e-compose-mode)
         (name . "\*mu4e\*")
         ))
         ("programming" (or
                 (mode . python-mode)
                 (mode . c++-mode)))
         ("emacs" (or
               (name . "^\\*scratch\\*$")
               (name . "^\\*Messages\\*$")))
         ))))
  (add-hook 'ibuffer-mode-hook
        (lambda ()
          (ibuffer-auto-mode 1)
          (ibuffer-switch-to-saved-filter-groups "default")))

  ;; don't show these
                      ;(add-to-list 'ibuffer-never-show-predicates "zowie")
  ;; Don't show filter groups if there are no buffers in that group
  (setq ibuffer-show-empty-filter-groups nil)

  ;; Don't ask for confirmation to delete marked buffers
  (setq ibuffer-expert t)

#+END_SRC
* Prodigy Service

  Define more services
#+BEGIN_SRC emacs-lisp
  (use-package prodigy
    :ensure t
    :config)

  (prodigy-define-service
    :name "Python app"
    :command "/usr/bin/python"
    :args '("-m" "SimpleHTTPServer" "6001")
    :cwd "/Dropbox/Dropbox/xingwenju.com/blogs/output"
    :tags '(work)
    :stop-signal 'sigkill
    :kill-process-buffer-on-stop t)

  (prodigy-define-service
    :name "Nikola Blog Local Serve"
    :command "/usr/local/anaconda3/bin/nikola"
    :args '("serve" "-p" "9999")
    :cwd "/Dropbox/Dropbox/xingwenju.com/blogs"
    :tags '(work)
    :stop-signal 'sigkill
    :kill-process-buffer-on-stop t)

  (prodigy-define-service
    :name "Nikola Blog Build"
    :command "/usr/local/anaconda3/bin/nikola"
    :args '("build")
    :cwd "/Dropbox/Dropbox/xingwenju.com/blogs"
    :tags '(work)
    :stop-signal 'sigkill
    :kill-process-buffer-on-stop t)

  (prodigy-define-service
    :name "Nikola Blog Deploy Github"
    :command "/usr/local/anaconda3/bin/nikola"
    :args '("github_deploy")
    :cwd "/Dropbox/Dropbox/xingwenju.com/blogs"
    :tags '(work)
    :stop-signal 'sigkill
    :kill-process-buffer-on-stop t)
#+END_SRC

#+RESULTS:
| :name | Nikola Blog Deploy Github | :command | /usr/local/anaconda3/bin/nikola | :args | (github_deploy)            | :cwd | /Dropbox/Dropbox/xingwenju.com/blogs        | :tags | (work) | :stop-signal | sigkill | :kill-process-buffer-on-stop | t |          |             |
| :name | Nikola Blog               | :command | /usr/local/anaconda3/bin/nikola | :args | (serve -p 9999)            | :cwd | /Dropbox/Dropbox/xingwenju.com/blogs        | :tags | (work) | :stop-signal | sigkill | :kill-process-buffer-on-stop | t | :process | Nikola Blog |
| :name | Python app                | :command | /usr/bin/python                 | :args | (-m SimpleHTTPServer 6001) | :cwd | /Dropbox/Dropbox/xingwenju.com/blogs/output | :tags | (work) | :stop-signal | sigkill | :kill-process-buffer-on-stop | t |          |             |

* Treemacs

I use the =treemacs= instead of =neotree= to show the explorer



#+BEGIN_SRC emacs-lisp
  (use-package treemacs
    :ensure t
    :defer t
    :config
    (progn

    (setq treemacs-follow-after-init          t
      treemacs-width                      35
      treemacs-indentation                2
      treemacs-git-integration            t
      treemacs-collapse-dirs              3
      treemacs-silent-refresh             nil
      treemacs-change-root-without-asking nil
      treemacs-sorting                    'alphabetic-desc
      treemacs-show-hidden-files          t
      treemacs-never-persist              nil
      treemacs-is-never-other-window      nil
      treemacs-goto-tag-strategy          'refetch-index)

    (treemacs-follow-mode t)
    (treemacs-filewatch-mode t)
    ))

  (use-package treemacs-projectile
  :defer t
  :ensure t
  :config
  (setq treemacs-header-function #'treemacs-projectile-create-header))

#+END_SRC

#+RESULTS:

* Load other files
   #+BEGIN_SRC emacs-lisp
     (defun load-if-exists (f)
       "load the elisp file only if it exists and is readable"
       (if (file-readable-p f)
       (load-file f)))

     (defun babel-load-if-exists (f)
       "babel load the elisp file only if it exists and is readable"
       (if (file-readable-p f)
       (org-babel-load-file f)))

     (load-if-exists "~/Dropbox/config/emacs/modules/services/ssh-tunnel.el")
     (load-if-exists "~/Dropbox/config/emacs/modules/services/xingwenju-email.el")
     (load-if-exists "~/Dropbox/config/emacs/common/aliases.el")

   #+END_SRC

   #+RESULTS:
   : t
* Misc functions

More functions will be loaded from [[file:~/Dropbox/config/emacs/common/xingwenju-helpers.org][helper functions]]

#+BEGIN_SRC emacs-lisp

  (babel-load-if-exists "~/Dropbox/config/emacs/common/xingwenju-helpers.org")

#+END_SRC

#+RESULTS:
: Loaded /Dropbox/Dropbox/config/emacs/common/xingwenju-helpers.el


Basic functions reload the init file

#+BEGIN_SRC emacs-lisp

  (defun xingwenju/reload-init ()
    "Reload the init file"
    (interactive)
    (load-file "~/Dropbox/config/emacs/common/init.el")
    )

  (defun xingwenju/set-bookmark-file ()
    "Load the bookmark file"
    (interactive)
    (setq bookmark-file "~/Dropbox/shared/emacs-bookmarks")
    (bookmark-load bookmark-file)
    )

  (xingwenju/set-bookmark-file)
#+END_SRC

#+RESULTS:
: Loading bookmarks from ~/Dropbox/shared/emacs-bookmarks...done

#+BEGIN_SRC emacs-lisp
  (defun xingwenju/load-library ()
  "Load some library of reveal"
  (interactive)
  (load-library "ox-reveal")
  )


  (xingwenju/load-library)
#+END_SRC

#+RESULTS:
: t

* W3m

#+BEGIN_SRC emacs-lisp

  (defun set-w3m-command ()
    "Set the w3m-command for different OS"
    (if (string-equal system-type "darwin")
      (setq w3m-command "/usr/local/Cellar/w3m/0.5.3/bin/w3m"))
    (if (string-equal system-type "gnu/linux")
      (setq w3m-command "/usr/local/bin/w3m"))
    (if (string-equal system-type "windows-nt")
      (setq w3m-command "c:\var\w3m\bin\w3m"))
  )
  (use-package w3m
      :ensure t
      :init
      (set-w3m-command)
      :config
      (setq w3m-bookmark-file "~/Dropbox/shared/www-bookmarks.html")
  )

  ;; (w3m-goto-url (concat "file://" w3m-bookmark-file))
#+END_SRC

#+RESULTS:
: t

* Nikola

Each time start the emacs, serve the blogs with nikola

I also setup the =prodigy= service to start the =nikola=


#+BEGIN_SRC emacs-lisp
(use-package nikola :ensure t)
(use-package ox-nikola :ensure t)
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (defun xingwenju/nikola-deploy ()
    "Nikola deploy to Github Page"
    (interactive)
    (shell-command "cd ~/Dropbox/xingwenju.com/blogs; nikola github_deploy")
    )

  (defun xingwenju/nikola-serve ()
    "Nikola serve with local server"
    (interactive)
    (shell-command "cd ~/Dropbox/xingwenju.com/blogs; nikola serve -p 9999 &")
    )

  (defun xingwenju/nikola-build ()
    "Nikola build new pages"
    (interactive)
    (shell-command "cd ~/Dropbox/xingwenju.com/blogs; nikola build &")
    )
#+END_SRC

#+RESULTS:
: xingwenju/nikola-build
