elisp/basic/myinit.el

(use-package elfeed
  :ensure t
  :config
  (setq elfeed-db-directory "~/Dropbox/shared/elfeeddb")
  (setq elfeed-feeds
  '("http://nullprogram.com/feed/"
    "http://jr0cket.co.uk/atom.xml"
    "https://linuxing3.github.io/rss.xml"
    "http://ergoemacs.org/emacs/blog.xml"
    "http://planet.emacsen.org/atom.xml"))
  )


;; wget https://github.com/remyhonig/elfeed-org/blob/master/elfeed-org.el
(use-package elfeed-org
  :ensure t
  :config
 (setq rmh-elfeed-org-files (list
   "~/Dropbox/config/emacs/literate/xingwenju-elfeed-resource.org"
  )))

(use-package ggtags
:ensure t
:config
(add-hook 'c-mode-common-hook
      (lambda ()
        (when (derived-mode-p 'c-mode 'c++-mode 'java-mode)
          (ggtags-mode 1))))
)

(use-package dumb-jump
  :bind (("M-g o" . dumb-jump-go-other-window)
     ("M-g j" . dumb-jump-go)
     ("M-g x" . dumb-jump-go-prefer-external)
     ("M-g z" . dumb-jump-go-prefer-external-other-window))
  :config
  ;; (setq dumb-jump-selector 'ivy) ;; (setq dumb-jump-selector 'helm)
:init
(dumb-jump-mode)
  :ensure
)

(use-package origami
:ensure t)

(global-set-key (kbd "C-x C-b") 'ibuffer)
(setq ibuffer-saved-filter-groups
  (quote (("default"
       ("dired" (mode . dired-mode))
       ("org" (name . "^.*org$"))

       ("web" (or (mode . web-mode) (mode . js2-mode)))
       ("shell" (or (mode . eshell-mode) (mode . shell-mode)))
       ("mu4e" (or

       (mode . mu4e-compose-mode)
       (name . "\*mu4e\*")
       ))
       ("programming" (or
               (mode . python-mode)
               (mode . c++-mode)))
       ("emacs" (or
             (name . "^\\*scratch\\*$")
             (name . "^\\*Messages\\*$")))
       ))))
(add-hook 'ibuffer-mode-hook
      (lambda ()
        (ibuffer-auto-mode 1)
        (ibuffer-switch-to-saved-filter-groups "default")))

;; don't show these
                    ;(add-to-list 'ibuffer-never-show-predicates "zowie")
;; Don't show filter groups if there are no buffers in that group
(setq ibuffer-show-empty-filter-groups nil)

;; Don't ask for confirmation to delete marked buffers
(setq ibuffer-expert t)

(use-package prodigy
  :ensure t
  :config)

(prodigy-define-service
  :name "Python app"
  :command "/usr/bin/python"
  :args '("-m" "SimpleHTTPServer" "6001")
  :cwd "/Dropbox/Dropbox/xingwenju.com/blogs/output"
  :tags '(work)
  :stop-signal 'sigkill
  :kill-process-buffer-on-stop t)

(prodigy-define-service
  :name "Nikola Blog Local Serve"
  :command "/usr/local/anaconda3/bin/nikola"
  :args '("serve" "-p" "9999")
  :cwd "/Dropbox/Dropbox/xingwenju.com/blogs"
  :tags '(work)
  :stop-signal 'sigkill
  :kill-process-buffer-on-stop t)

(prodigy-define-service
  :name "Nikola Blog Build"
  :command "/usr/local/anaconda3/bin/nikola"
  :args '("build")
  :cwd "/Dropbox/Dropbox/xingwenju.com/blogs"
  :tags '(work)
  :stop-signal 'sigkill
  :kill-process-buffer-on-stop t)

(prodigy-define-service
  :name "Nikola Blog Deploy Github"
  :command "/usr/local/anaconda3/bin/nikola"
  :args '("github_deploy")
  :cwd "/Dropbox/Dropbox/xingwenju.com/blogs"
  :tags '(work)
  :stop-signal 'sigkill
  :kill-process-buffer-on-stop t)

(use-package treemacs
  :ensure t
  :defer t
  :config
  (progn

  (setq treemacs-follow-after-init          t
    treemacs-width                      35
    treemacs-indentation                2
    treemacs-git-integration            t
    treemacs-collapse-dirs              3
    treemacs-silent-refresh             nil
    treemacs-change-root-without-asking nil
    treemacs-sorting                    'alphabetic-desc
    treemacs-show-hidden-files          t
    treemacs-never-persist              nil
    treemacs-is-never-other-window      nil
    treemacs-goto-tag-strategy          'refetch-index)

  (treemacs-follow-mode t)
  (treemacs-filewatch-mode t)
  ))

(use-package treemacs-projectile
:defer t
:ensure t
:config
(setq treemacs-header-function #'treemacs-projectile-create-header))

(defun load-if-exists (f)
  "load the elisp file only if it exists and is readable"
  (if (file-readable-p f)
  (load-file f)))

(defun babel-load-if-exists (f)
  "babel load the elisp file only if it exists and is readable"
  (if (file-readable-p f)
  (org-babel-load-file f)))

(defun xingwenju/reload-init ()
  "Reload the init file"
  (interactive)
  (load-file "~/Dropbox/config/emacs/common/init.el")
  )

(defun xingwenju/set-bookmark-file ()
  "Load the bookmark file"
  (interactive)
  (setq bookmark-file "~/Dropbox/shared/emacs-bookmarks")
  (bookmark-load bookmark-file)
  )
(defun set-w3m-command ()
  "Set the w3m-command for different OS"
  (if (string-equal system-type "darwin")
    (setq w3m-command "/usr/local/Cellar/w3m/0.5.3/bin/w3m"))
  (if (string-equal system-type "gnu/linux")
    (setq w3m-command "/usr/local/bin/w3m"))
  (if (string-equal system-type "windows-nt")
    (setq w3m-command "c:\var\w3m\bin\w3m"))
)
